# data.py
from models import Vocabulary, GrammarPoint, Question, Test

# Лексика
vocabulary_words = [
    Vocabulary("안녕하세요", "Здравствуйте", "Общие"),
    Vocabulary("감사합니다", "Спасибо", "Общие"),
    Vocabulary("사과", "Яблоко", "Еда"),
    Vocabulary("밥", "Рис/Еда", "Еда")
]

# Грамматика
grammar_rules = [
    GrammarPoint("-(으)세요", "Вежливая форма глагола", "Начинающий"),
    GrammarPoint("-고", "И", "Начинающий")
]

# Вопросы (пример)
test_questions = [
    Question(
        "Как сказать 'Здравствуйте' по-корейски?",
        ["안녕하세요", "감사합니다", "안녕", "밥"],
        0,
        "Правильный ответ - 안녕하세요."
    ),
    Question(
        "Как сказать 'Спасибо' по-корейски?",
        ["안녕하세요", "감사합니다", "안녕", "밥"],
        1,
        "Правильный ответ - 감사합니다."
    ),
    Question(
        "Выберите правильное написание слова 'яблоко'",
        ["사과", "가사", "비다", "안녕"],
        0,
        "Правильный ответ - 사과."
    )
]

# Тесты
test1 = Test("Пробный тест TOPIK I", test_questions, "TOPIK I")